app/views/devise/registrations/new.html.erb

<p>Interests</p>
  <div><%= f.collection_select :interest_ids, Interest.all, :id, :name %></div>
---
SELECT "interests".* FROM "interests"