app/controllers/registrations_controller.rb

  def update
    @user = User.find(current_user.id)

    successfully_updated = if needs_password?(@user, params)
      @user.update_with_password(devise_parameter_sanitizer.sanitize(:account_update))
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1
UPDATE "users" SET "image_1" = 'batman.jpg', "image_2" = 'Botero-Mona_Lisa.jpg', "image_3" = 'winter-sparkle-original-madart-painting-megan-duncanson.jpg', "updated_at" = '2014-08-19 16:02:28.952073' WHERE "users"."id" = 17