app/controllers/users_controller.rb

SELECT "users".* FROM "users"  WHERE "users"."id" = 0
SELECT "interests".* FROM "interests" INNER JOIN "interests_users" ON "interests"."id" = "interests_users"."interest_id" WHERE "interests_users"."user_id" = 3
SELECT "users".* FROM "users"  WHERE "users"."gender" = 'male' AND "users"."looking_for" = 'male' AND (id != 4)
---
  def index
    @users = User.where("id != ?", current_user.id)

    @users = @users.looking(current_user.looking_for, current_user.gender)
    @users = @users.interests(@users, current_user.interests[0].name)

    @user = @users.shuffle.first

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1
---
  def show
    @user = User.find(current_user.id)