app/controllers/user_connections_controller.rb

INSERT INTO "user_connections" ("created_at", "interacted", "negative_connection", "updated_at", "user_1_id", "user_2_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user_connection = UserConnection.new(params[:user_connections])
    respond_to do |format|
      if @user_connection.save