app/models/user.rb

  def self.from_omniauth(auth)

    twitter_email = if auth.provider =="twitter" then auth.info.nickname.downcase + "@twitter.com" end
    instagram_email = if auth.provider =="instagram" then auth.info.nickname.downcase + "@instagram.com" end

    if user = User.find_by_email(auth.info.email) || user = User.find_by_email(twitter_email) || user = User.find_by_email(instagram_email)
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'jwchristie@blueyonder.co.uk' LIMIT 1

          })

      else
        where(auth.slice(:provider, :uid)).first_or_create do |user|
---
INSERT INTO "users" ("about_me", "confirmation_sent_at", "confirmation_token", "confirmed_at", "created_at", "current_sign_in_at", "current_sign_in_ip", "dob", "email", "encrypted_password", "first_name", "gender", "image_1", "image_2", "image_3", "last_name", "last_sign_in_at", "last_sign_in_ip", "looking_for", "post_code", "profile_pic", "provider", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "uid", "unconfirmed_email", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29) RETURNING "id"
SELECT  "users".* FROM "users"  WHERE "users"."provider" = 'facebook' AND "users"."uid" = '10154564812510425' LIMIT 1